wiki/netty/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Netty的使用及源代码阅读心得</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Netty的使用及源代码阅读心得"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-30 Wed"/>
<meta name="author" content="Kelvin Hu"/>
<meta name="description" content="some notes of netty framework, version 4.x"/>
<meta name="keywords" content="netty, java, nio"/>
<link href="/media/css/main.css" rel="stylesheet" type="text/css" />


</head>
<body>

<div id="preamble">
<hgroup id="header">
  <h1><a href="/">Kelvin的胡言乱语</a></h1>
  <h2>重剑无锋，大巧不工。</h2>
</hgroup>
<nav id="main-nav">
  <ul id="nav-list-main">
    <li><a href="/blog/" class="menu">Blog</a></li>
    <li><a href="/wiki/" class="menu">Wiki</a></li>
    <li><a href="/tags/" class="menu">Tags</a></li>
    <li><a href="/about/" class="menu">About</a></li>
  </ul>
</nav>
<nav id="sub-nav" class="align-right">
  <div class="social">
    <a class="github" title="GitHub" href="https://github.com/kelvinh">GitHub</a>
    <!-- TODO: change the link below to proper value  -->
    <a class="rss" title="RSS(TODO)" href="TODO">RSS</a>
  </div>
  <form class="search" target="_blank" method="get" action="http://google.com/search">
    <input type="hidden" value="site:kelvinh.github.com" name="q" />
    <input type="text" class="align-right" results="0" name="q" />
  </form>
</nav>

</div>

<div id="content">
<h1 class="title">Netty的使用及源代码阅读心得</h1>


<p>
记录一些关于netty使用以及源代码的阅读心得。
</p>
<p>
<b>最新说明</b> ：因为本人换了team，新team可能再也接触不到跟Java有关的东西了，而除了项目之外，本人也实在没有太多精力去再看nettty的源代码，所以，这一篇关于netty的心得可能到这里就不会再更新了 &mdash; <span class="timestamp-wrapper"> <span class="timestamp">2013-03-27</span></span>
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><code>ChannelInitializer&lt;C extends Channel&gt;</code></h2>
<div class="outline-text-2" id="text-1">


<p>
  这个类本身也是一个handler，主要关注 <code>channel register</code> 事件，关键方法如下：
</p>
<pre class="example">
public final void channelRegistered(ChannelHandlerContext ctx)
        throws Exception {
    boolean removed = false;
    boolean success = false;
    try {
        initChannel((C) ctx.channel());
        ctx.pipeline().remove(this);
        removed = true;
        ctx.fireChannelRegistered();
        success = true;
    } catch (Throwable t) {
        // ...
    } finally {
        // ...
    }
}
</pre>


<p>
  注意其中的 <code>initChannel(...)</code> 方法调用，这个方法在这个类里定义为abstract，所以子类需要实现之，以进行channel的初始化，如添加handler等。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">DefaultChannelHandlerContext中的Buffer Chain</h2>
<div class="outline-text-2" id="text-2">


<p>
  DefaultChannelHandlerContext本身就是一系列context chain的一个结点，每个结点会维护prev和next两个指针，分别指向前后结点。
</p>
<p>
  需要注意的是，这个context chain是双向的，在查找inbound的next buffer的时候，会顺着next指针朝前找；而查找outbound的next buffer的时候，会顺着prev指针朝回找。
</p>
<p>
  每个context中，针对inbound和outbound都保留了两个类型的buffer引用：ByteBuf和MessageBuf，但是一个context只会有一种类型，这就要看当前的handler是下面的哪一种类型了：
</p>
<ul>
<li>ChannelInboundByteHandler
</li>
<li>ChannelInboundMessageHandler
</li>
<li>ChannelOutboundByteHandler
</li>
<li>ChannelInboundMessageHandler
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><code>AttributeMap &amp; attr()</code></h2>
<div class="outline-text-2" id="text-3">


<p>
  Java NIO的SelectionKey中有一个attachment，这在传递一些额外的信息时很有用，Netty也有类似的实现，就是 <code>AttributeMap</code> 这个接口，其只定义了一个 <code>attr()</code> 方法。
</p>
<p>
  <code>DefaultAttributeMap</code> 实现了这个接口，而 <code>DefaultChannelHandlerContext</code> 则继承了这个类，于是所有的Channel Context都可以附带额外信息了。attr()的实现如下：
</p>
<pre class="example">
public synchronized &lt;T&gt; Attribute&lt;T&gt; attr(AttributeKey&lt;T&gt; key) {
    Map&lt;AttributeKey&lt;?&gt;, Attribute&lt;?&gt;&gt; map = this.map;
    if (map == null) {
        // Not using ConcurrentHashMap due to high memory consumption.
        map = this.map = new IdentityHashMap&lt;AttributeKey&lt;?&gt;, Attribute&lt;?&gt;&gt;(2);
    }

    @SuppressWarnings("unchecked")
    Attribute&lt;T&gt; attr = (Attribute&lt;T&gt;) map.get(key);
    if (attr == null) {
        attr = new DefaultAttribute&lt;T&gt;();
        map.put(key, attr);
    }
    return attr;
}
</pre>


<p>
  可以看到，其内部是用了一个 <code>IdentityHashMap</code> 来保存key-value的信息，其key的类型是 <code>AttributeKey&lt;T&gt;</code> ，而value则是 <code>Attribute&lt;T&gt;</code> 。而这个 <code>Attribute&lt;T&gt;</code> 接口的实现如下（在DefaultAttributeMap的定义中）：
</p>
<pre class="example">
private class DefaultAttribute&lt;T&gt; extends AtomicReference&lt;T&gt; implements Attribute&lt;T&gt;
...
</pre>


<p>
  而 <code>AtomicReference&lt;T&gt;</code> 则是java concurrent包中的类，Netty直接继承之以实现对象的get()/set()的并发访问。
</p>
<p>
  <b>注意</b> : ChannelHandlerContext和Channel都扩展了该接口，但Channel Handler Context只是针对于当前handler的Context，如果要将某些信息在不同的handler之间传递，需要设置Channel的attr。
</p></div>
</div>
</div>

<div id="postamble">
<div id="post-meta">
  <span title="post date" class="post-info">2013-01-30</span>
  <span title="last modification date" class="update-info">2013-04-01</span>
  <span title="tags" class="tags"><a href="/tags/netty/">Netty</a>, <a href="/tags/java/">Java</a></span>
  <span title="author" class="author">Kelvin Hu</span>
</div>
<div id="footer">
  <p class="creator">Generated by Org version 7.9.4 with Emacs version 24</p>
  <p class="copyright">
    Copyright &copy; 2012 - 2013 <a href="mailto:ini &lt;dot&gt; kelvin &lt;at&gt; gmail &lt;dot&gt; com">Kelvin Hu</a>
    &nbsp;&nbsp;-&nbsp;&nbsp;
    Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
  </p>
</div>

</div>
</body>
</html>
